In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],
     'B':[5,np.nan,np.nan],
     'C':[1,2,3]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
 df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [11]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [12]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# PANDAS PRACTICE

In [18]:
import numpy as np
import pandas as pd

In [29]:
dic = {'A':[1,2,3,np.nan,5],
       'B':[6,np.nan,np.nan,9,9],
       'C':[6,5,np.nan,6,2],
       'D':[5,8,6,4,7]}

In [30]:
z = pd.DataFrame(dic)

In [31]:
z

     A    B    C  D
0  1.0  6.0  6.0  5
1  2.0  NaN  5.0  8
2  3.0  NaN  NaN  6
3  NaN  9.0  6.0  4
4  5.0  9.0  2.0  7

In [32]:
z.dropna()

     A    B    C  D
0  1.0  6.0  6.0  5
4  5.0  9.0  2.0  7

In [33]:
z.dropna(axis=1)

   D
0  5
1  8
2  6
3  4
4  7

In [37]:
z

     A    B    C  D
0  1.0  6.0  6.0  5
1  2.0  NaN  5.0  8
2  3.0  NaN  NaN  6
3  NaN  9.0  6.0  4
4  5.0  9.0  2.0  7

In [47]:
z.dropna(thresh=3)

     A    B    C  D
0  1.0  6.0  6.0  5
1  2.0  NaN  5.0  8
3  NaN  9.0  6.0  4
4  5.0  9.0  2.0  7

In [48]:
z.fillna(value=5)

     A    B    C  D
0  1.0  6.0  6.0  5
1  2.0  5.0  5.0  8
2  3.0  5.0  5.0  6
3  5.0  9.0  6.0  4
4  5.0  9.0  2.0  7